In [4]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
country = pd.read_csv('new.csv')

In [35]:
country.head()

  code      name    lat  long    count
0  MDV  Maldives   3.25  73.0  18915.0
1  FIN   Finland  64.00  26.0  24795.0
2  NER     Niger  16.00   8.0  77484.0
3  URY   Uruguay -33.00 -56.0  58052.0
4  ZWE  Zimbabwe -20.00  30.0  90335.0

In [10]:
country = country.drop('region', axis=1)

In [11]:
country = country.drop('continent', axis=1)

In [34]:
country.head()

  code      name    lat  long    count
0  MDV  Maldives   3.25  73.0  18915.0
1  FIN   Finland  64.00  26.0  24795.0
2  NER     Niger  16.00   8.0  77484.0
3  URY   Uruguay -33.00 -56.0  58052.0
4  ZWE  Zimbabwe -20.00  30.0  90335.0

In [28]:
country.columns = ['code','name','lat','long','count']

In [36]:
country.head()

  code      name    lat  long    count
0  MDV  Maldives   3.25  73.0  18915.0
1  FIN   Finland  64.00  26.0  24795.0
2  NER     Niger  16.00   8.0  77484.0
3  URY   Uruguay -33.00 -56.0  58052.0
4  ZWE  Zimbabwe -20.00  30.0  90335.0

In [7]:
s = pd.Series([7,'hello',3.123,-12341234,'Hello World'])

In [8]:
s

0              7
1          hello
2          3.123
3      -12341234
4    Hello World
dtype: object

In [9]:
s[3]

-12341234

In [13]:
s = pd.Series([7,'hello',3.123,-12341234,'Hello World'],index=['A','B','C','D','E'])

In [14]:
s['B']

'hello'

In [15]:
s = pd.Series([7,21,3.123,-12341234,30],index=['A','B','C','D','E'])

In [16]:
s[s > 0]

A     7.000
B    21.000
C     3.123
E    30.000
dtype: float64

In [18]:
s < 0

A    False
B    False
C    False
D     True
E    False
dtype: bool

In [22]:
data = {'year':[2010,2011,20112,2011,2012],
       'team':['Bears','Bears','Vikings','Packers','Vikings'],
       'wins':[1,3,10,2,10]
       }
fb = pd.DataFrame(data,columns=['year','team','wins'])

fb

    year     team  wins
0   2010    Bears     1
1   2011    Bears     3
2  20112  Vikings    10
3   2011  Packers     2
4   2012  Vikings    10

In [30]:
fb.describe()

               year       wins
count      5.000000   5.000000
mean    5631.200000   5.200000
std     8095.013323   4.438468
min     2010.000000   1.000000
25%     2011.000000   2.000000
50%     2011.000000   3.000000
75%     2012.000000  10.000000
max    20112.000000  10.000000

In [31]:
fb.wins.describe()

count     5.000000
mean      5.200000
std       4.438468
min       1.000000
25%       2.000000
50%       3.000000
75%      10.000000
max      10.000000
Name: wins, dtype: float64

In [32]:
fb[fb.wins>9]

    year     team  wins
2  20112  Vikings    10
4   2012  Vikings    10

In [37]:
fb.wins>9

0    False
1    False
2     True
3    False
4     True
Name: wins, dtype: bool